Revit 2026 API

# CategorySetErase Method

---

Removes a specified category from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	Category item
)
```
```vb
Public Overridable Function Erase (
	item As Category
) As Integer
```
```cpp
public:
virtual int Erase(
	Category^ item
)
```
```fsharp
abstract Erase :
        item : Category -> int
override Erase :
        item : Category -> int
```

#### Parameters

item Category
    The category to be erased.

#### Return Value

Int32The number of items that were erased from the set.

#### Reference

CategorySet Class

Autodesk.Revit.DB Namespace